Revit 2017 API
RevitLinkLoadResult.IsCodeSuccess Method
 Check if load result code signifies success.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public static bool IsCodeSuccess(
	RevitLinkLoadResultType code
)
Visual Basic
Public Shared Function IsCodeSuccess ( _
	code As RevitLinkLoadResultType _
) As Boolean
Visual C++
public:
static bool IsCodeSuccess(
	RevitLinkLoadResultType code
)
Parameters
code
Type: Autodesk.Revit.DB.RevitLinkLoadResultType
 Load result code to be verified.
Return Value
 True if LinkLoadResultType argument is success, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
RevitLinkLoadResult Class
Autodesk.Revit.DB Namespace